simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main.cpp
static const char *psocCalStageName(uint8_t stage)
{
    switch (stage) {
        case 0:  return "GEO_PGA";
        case 1:  return "GEO_BP";
        case 2:  return "GEO_ADDER";
        case 3:  return "GEO_LP";
        default: return "UNKNOWN";
    }
}

static uint32_t absCounts32(int32_t value)
{
    return (value < 0) ? (uint32_t)(-value) : (uint32_t)value;
}

static void onPsocDiag(const PsocDiagEvent &event)
{
    static uint8_t calStage = 0xFF;
    static uint8_t calDac = 0;
    static int16_t calMeas = 0;
    static bool calMeasHigh = false;
    static uint32_t calMeasRaw = 0;
    static int32_t calMeasRawSigned = 0;
    static uint8_t calMeasRawByte = 0;
    static uint16_t calPointIndex = 0;
    g_psocConnected = true;

    if (g_state == SAMPLING && event.event != PSOC_EVT_DUMP_DONE) {
        return;
    }

    if (event.event == PSOC_EVT_DUMP_DONE && g_view_store_active &&
        g_state == SAMPLING && g_store_fill < g_rec_n_batches) {
        digitalWrite(SYNC_TO_PSOC_PIN, LOW);
        g_view_store_active = false;
        g_state = STOPPED;
        sendCfgAck(CMD_VIEW, 0);
        SLAVE_LOG_PRINTF("[SLAVE] VIEW partial dump fill=%u/%u -> FAIL\n",
                         (unsigned)g_store_fill, (unsigned)g_rec_n_batches);
        LOGM("VIEW_PARTIAL", "fill=%u,n=%u,bOK=%lu,bBad=%lu,drop=%lu,bytes=%lu",
             (unsigned)g_store_fill, (unsigned)g_rec_n_batches,
             (unsigned long)psoc.batchesOK(),
             (unsigned long)psoc.batchesBad(),
             (unsigned long)psoc.syncDrops(),
             (unsigned long)psoc.bytesRx());
    }

    if (event.event == PSOC_EVT_CAL_START) {
        calStage = 0;
        calDac = 0;
        calMeas = 0;
        calMeasHigh = false;
        calMeasRaw = 0;
        calMeasRawSigned = 0;
        calMeasRawByte = 0;
        calPointIndex = 0;
        g_cal_progress_ack_ms = millis();
        sendCfgAck(PSOC_CMD_CALIBRATE, 2);
        SLAVE_LOG_PRINTF("[CAL] start\n");
        LOGM("CAL_START", "pstate=%u", event.psoc_state);
    } else if (event.event == PSOC_EVT_CAL_DONE) {
        if (!(g_cfg_waiting && g_cfg_sub_cmd == PSOC_CMD_CALIBRATE)) {
            sendCfgAck(PSOC_CMD_CALIBRATE, event.value ? 1 : 0);
        }
        SLAVE_LOG_PRINTF("[CAL] done ok=%u\n", event.value);
        LOGM("CAL_DONE", "ok=%u,pstate=%u", event.value, event.psoc_state);
    } else if (event.event == PSOC_EVT_CAL_BUSY) {
        SLAVE_LOG_PRINTF("[CAL] busy\n");
        LOGM("CAL_BUSY", "pstate=%u", event.psoc_state);
    } else if (event.event == PSOC_EVT_CAL_STAGE_BEGIN) {
        calStage = event.value;
        calDac = 0;
        calMeas = 0;
        calMeasHigh = false;
        calMeasRaw = 0;
        calMeasRawSigned = 0;
        calMeasRawByte = 0;
        calPointIndex = 0;
        g_cal_progress_ack_ms = millis();
        sendCfgAck(PSOC_CMD_CALIBRATE, (uint8_t)(3u + (event.value & 0x03u)));
        SLAVE_LOG_PRINTF("[CAL] begin stage=%u/%s\n",
                         event.value, psocCalStageName(event.value));
        LOGM("CAL_BEGIN", "stage=%u,name=%s", event.value,
             psocCalStageName(event.value));
    } else if (event.event == PSOC_EVT_SERVO_STAGE) {
        calStage = event.value;
        calDac = 0;
        calMeas = 0;
        calMeasHigh = false;
        calMeasRaw = 0;
        calMeasRawSigned = 0;
        calMeasRawByte = 0;
        calPointIndex = 0;
        SLAVE_LOG_PRINTF("[CAL] servo stage=%u/%s\n",
                         event.value, psocCalStageName(event.value));
        LOGM("SERVO_STAGE", "stage=%u,name=%s", event.value,
             psocCalStageName(event.value));
    } else if (event.event == PSOC_EVT_CAL_VERIFY_BEGIN) {
        calStage = event.value;
        calDac = 0;
        calMeas = 0;
        calMeasHigh = false;
        calMeasRaw = 0;
        calMeasRawSigned = 0;
        calMeasRawByte = 0;
        calPointIndex = 0;
        g_cal_progress_ack_ms = millis();
        sendCfgAck(PSOC_CMD_CALIBRATE, (uint8_t)(7u + (event.value & 0x03u)));
        SLAVE_LOG_PRINTF("[CAL] verify begin stage=%u/%s\n",
                         event.value, psocCalStageName(event.value));
        LOGM("CAL_VERIFY_BEGIN", "stage=%u,name=%s", event.value,
             psocCalStageName(event.value));
    } else if (event.event == PSOC_EVT_CAL_REALCHECK_BEGIN) {
        calStage = event.value;
        calDac = 0;
        calMeas = 0;
        calMeasHigh = false;
        calMeasRaw = 0;
        calMeasRawSigned = 0;
        calMeasRawByte = 0;
        calPointIndex = 0;
        g_cal_progress_ack_ms = millis();
        sendCfgAck(PSOC_CMD_CALIBRATE, (uint8_t)(11u + (event.value & 0x03u)));
        SLAVE_LOG_PRINTF("[CAL] realcheck begin stage=%u/%s\n",
                         event.value, psocCalStageName(event.value));
        LOGM("CAL_REALCHECK_BEGIN", "stage=%u,name=%s", event.value,
             psocCalStageName(event.value));
    } else if (event.event == PSOC_EVT_CAL_STAGE_DAC) {
        calDac = event.value;
    } else if (event.event == PSOC_EVT_CAL_STAGE_MEAS) {
        if (!calMeasHigh) {
            calMeas = (int16_t)((uint16_t)event.value << 8);
            calMeasHigh = true;
        } else {
            calMeas = (int16_t)((uint16_t)calMeas | event.value);
            calMeasHigh = false;
#if PSOC_CAL_LOG_CLAMPED_POINTS
            SLAVE_LOG_PRINTF("[CAL] point16 stage=%u/%s dac=%u meas=%d\n",
                             calStage, psocCalStageName(calStage),
                             calDac, (int)calMeas);
            LOGM("CAL_POINT16", "stage=%u,name=%s,dac=%u,meas=%d",
                 calStage, psocCalStageName(calStage), calDac, (int)calMeas);
#endif
        }
    } else if (event.event == PSOC_EVT_CAL_STAGE_MEAS32) {
        calMeasRaw = (calMeasRaw << 8) | event.value;
        calMeasRawByte++;
        if (calMeasRawByte >= 4) {
            uint32_t absRaw;
            calMeasRawByte = 0;
            calMeasRawSigned = (int32_t)calMeasRaw;
            absRaw = absCounts32(calMeasRawSigned);
#if PSOC_CAL_LOG_POINTS
            SLAVE_LOG_PRINTF("[CAL] point stage=%u/%s i=%u dac=%u raw=%ld abs=%lu\n",
                             calStage, psocCalStageName(calStage),
                             (unsigned)calPointIndex, calDac,
                             (long)calMeasRawSigned, (unsigned long)absRaw);
            LOGM("CAL_POINT32", "stage=%u,name=%s,i=%u,dac=%u,measRaw=%ld,abs=%lu",
                 calStage, psocCalStageName(calStage),
                 (unsigned)calPointIndex, calDac, (long)calMeasRawSigned,
                 (unsigned long)absRaw);
#endif
            calPointIndex++;
        }
    } else if (event.event == PSOC_EVT_CAL_REALCHECK_DAC) {
        calDac = event.value;
        calMeasRaw = 0;
        calMeasRawByte = 0;
    } else if (event.event == PSOC_EVT_CAL_REALCHECK_MEAS32) {
        calMeasRaw = (calMeasRaw << 8) | event.value;
        calMeasRawByte++;
        if (calMeasRawByte >= 4) {
            uint32_t absRaw;
            calMeasRawByte = 0;
            calMeasRawSigned = (int32_t)calMeasRaw;
            absRaw = absCounts32(calMeasRawSigned);
#if PSOC_CAL_LOG_POINTS
            SLAVE_LOG_PRINTF("[CAL] realcheck point stage=%u/%s i=%u dac=%u raw=%ld abs=%lu\n",
                             calStage, psocCalStageName(calStage),
                             (unsigned)calPointIndex, calDac,
                             (long)calMeasRawSigned, (unsigned long)absRaw);
            LOGM("CAL_REALCHECK_POINT32", "stage=%u,name=%s,i=%u,dac=%u,measRaw=%ld,abs=%lu",
                 calStage, psocCalStageName(calStage),
                 (unsigned)calPointIndex, calDac, (long)calMeasRawSigned,
                 (unsigned long)absRaw);
#endif
            calPointIndex++;
        }
    } else if (event.event == PSOC_EVT_CAL_STAGE_OK) {
        uint32_t absRaw = absCounts32(calMeasRawSigned);
        SLAVE_LOG_PRINTF("[CAL] result stage=%u/%s ok=%u dac=%u raw=%ld abs=%lu meas16=%d\n",
                         calStage, psocCalStageName(calStage), event.value,
                         calDac, (long)calMeasRawSigned,
                         (unsigned long)absRaw, (int)calMeas);
        LOGM("CAL_STAGE", "stage=%u,name=%s,ok=%u,dac=%u,measRaw=%ld,abs=%lu,meas16=%d",
             calStage, psocCalStageName(calStage), event.value,
             calDac, (long)calMeasRawSigned, (unsigned long)absRaw,
             (int)calMeas);
    } else if (event.event == PSOC_EVT_SERVO_STEP) {
        SLAVE_LOG_PRINTF("[CAL] servo step stage=%u/%s dac=%u\n",
                         calStage, psocCalStageName(calStage), event.value);
        LOGM("SERVO_STEP", "stage=%u,name=%s,dac=%u",
             calStage, psocCalStageName(calStage), event.value);
    } else if (event.event == PSOC_EVT_CAL_LOOP) {
        SLAVE_LOG_PRINTF("[CAL] loop stage=%u/%s dac=%u -> best candidate\n",
                         calStage, psocCalStageName(calStage), event.value);
        LOGM("CAL_LOOP", "stage=%u,name=%s,dac=%u",
             calStage, psocCalStageName(calStage), event.value);
    } else if (event.event == PSOC_EVT_CAL_STAGE_SAT) {
        if (event.value) {
            SLAVE_LOG_PRINTF("[CAL] saturation stage=%u/%s dac=%u\n",
                             calStage, psocCalStageName(calStage), calDac);
            LOGM("CAL_SAT", "stage=%u,name=%s,dac=%u",
                 calStage, psocCalStageName(calStage), calDac);
        }
    } else if (event.event == PSOC_EVT_CAL_STAGE_SAT_ALL) {
        SLAVE_LOG_PRINTF("[CAL] all candidates saturated stage=%u/%s\n",
                         event.value, psocCalStageName(event.value));
        LOGM("CAL_SAT_ALL", "stage=%u,name=%s", event.value,
             psocCalStageName(event.value));
    } else if (event.event == PSOC_EVT_CAL_REALCHECK_NUDGE) {
        int8_t nudge = (int8_t)event.value;
        SLAVE_LOG_PRINTF("[CAL] realcheck nudge stage=%u/%s dac=%u step=%d\n",
                         calStage, psocCalStageName(calStage), calDac,
                         (int)nudge);
        LOGM("CAL_REALCHECK_NUDGE", "stage=%u,name=%s,dac=%u,step=%d",
             calStage, psocCalStageName(calStage), calDac, (int)nudge);
    } else if (event.event == PSOC_EVT_CAL_REALCHECK_OK) {
        uint32_t absRaw = absCounts32(calMeasRawSigned);
        SLAVE_LOG_PRINTF("[CAL] realcheck result stage=%u/%s ok=%u dac=%u raw=%ld abs=%lu\n",
                         calStage, psocCalStageName(calStage), event.value,
                         calDac, (long)calMeasRawSigned,
                         (unsigned long)absRaw);
        LOGM("CAL_REALCHECK", "stage=%u,name=%s,ok=%u,dac=%u,measRaw=%ld,abs=%lu",
             calStage, psocCalStageName(calStage), event.value,
             calDac, (long)calMeasRawSigned, (unsigned long)absRaw);
    } else if (event.event == PSOC_EVT_CAL_VERIFY_OK) {
        uint32_t absRaw = absCounts32(calMeasRawSigned);
        SLAVE_LOG_PRINTF("[CAL] verify stage=%u/%s ok=%u dac=%u raw=%ld abs=%lu meas16=%d\n",
                         calStage, psocCalStageName(calStage), event.value,
                         calDac, (long)calMeasRawSigned,
                         (unsigned long)absRaw, (int)calMeas);
        LOGM("CAL_VERIFY", "stage=%u,name=%s,ok=%u,dac=%u,measRaw=%ld,abs=%lu,meas16=%d",
             calStage, psocCalStageName(calStage), event.value,
             calDac, (long)calMeasRawSigned, (unsigned long)absRaw,
             (int)calMeas);
    } else if (event.event == PSOC_EVT_CAL_AMUX_IN) {
        SLAVE_LOG_PRINTF("[CAL] AMux_IN -> %u (%s)\n", event.value,
                         event.value == 0 ? "normal/captura" : "referencia/tierra virtual");
        LOGM("CAL_AMUX_IN", "channel=%u", event.value);
    } else if (event.event == PSOC_EVT_CAL_PROGRESS) {
        if (!(g_cfg_waiting && g_cfg_sub_cmd == PSOC_CMD_CALIBRATE)) {
            uint32_t now = millis();
            if ((uint32_t)(now - g_cal_progress_ack_ms) >=
                PSOC_CAL_PROGRESS_ACK_PERIOD_MS) {
                g_cal_progress_ack_ms = now;
                sendCfgAck(PSOC_CMD_CALIBRATE, 2);
            }
        }
#if PSOC_CAL_LOG_PROGRESS
        SLAVE_LOG_PRINTF("[CAL] progress stage=%u/%s\n",
                         event.value, psocCalStageName(event.value));
        LOGM("CAL_PROGRESS", "stage=%u,name=%s", event.value,
             psocCalStageName(event.value));
#endif
        /* Para calibracion manual, servicePsocConfigAck() emite el heartbeat
         * mientras g_cfg_waiting este activo. Para boot-cal autonoma no hay
         * pending ACK, asi que este evento mantiene vivo el estado del maestro. */
    } else if (event.event == PSOC_EVT_CAL_WATCHDOG) {
        SLAVE_LOG_PRINTF("[CAL] WATCHDOG timeout stage=%u/%s -> aborted\n",
                         event.value, psocCalStageName(event.value));
        LOGM("CAL_WATCHDOG", "stage=%u,name=%s", event.value,
             psocCalStageName(event.value));
    } else if (event.event == PSOC_EVT_CAL_LP_BAD) {
        SLAVE_LOG_PRINTF("[CAL] CRITICAL stage=%u/%s LP out of range\n",
                         event.value, psocCalStageName(event.value));
        LOGM("CAL_LP_BAD", "stage=%u,name=%s", event.value,
             psocCalStageName(event.value));
    } else if (event.event == PSOC_EVT_BUTTON) {
        SLAVE_LOG_PRINTF("[BUTTON] pressed pstate=%u/%s\n",
                         event.value, psocStateName(event.value));
        LOGM("BUTTON", "pstate=%u,pstateName=%s",
             event.value, psocStateName(event.value));
    } else if (event.event == PSOC_EVT_BUTTON_IGNORED) {
        SLAVE_LOG_PRINTF("[BUTTON] ignored pstate=%u/%s\n",
                         event.value, psocStateName(event.value));
        LOGM("BUTTON_IGNORED", "pstate=%u,pstateName=%s",
             event.value, psocStateName(event.value));
    }

#if PSOC_DIAG_VERBOSE
    const char *eventName = psocDiagName(event.event);
    const char *stateName = psocStateName(event.psoc_state);
    SLAVE_LOG_PRINTF("[SLAVE] PSOC_EVT %s event=0x%02X val=%u pstate=%u/%s estate=%d bytes=%lu bOK=%lu fill=%u/%u\n",
                     eventName, event.event, event.value,
                     event.psoc_state, stateName, (int)g_state,
                     (unsigned long)psoc.bytesRx(),
                     (unsigned long)psoc.batchesOK(),
                     (unsigned)g_store_fill, (unsigned)g_rec_n_batches);
    LOGM("PSOC_EVT", "event=0x%02X,name=%s,val=%u,pstate=%u,pstateName=%s,estate=%d,bytes=%lu,bOK=%lu,fill=%u/%u",
         event.event, eventName, event.value,
         event.psoc_state, stateName, (int)g_state,
         (unsigned long)psoc.bytesRx(),
         (unsigned long)psoc.batchesOK(),
         (unsigned)g_store_fill, (unsigned)g_rec_n_batches);
#endif
}

/* ── ISR GPIO hardware sync (IRAM para máxima velocidad) ────────────────── */
void IRAM_ATTR onSyncEdge()
{
    int level = digitalRead(SYNC_IN_PIN);
    if (level == HIGH && g_state == HOT_WAIT) {
        digitalWrite(SYNC_TO_PSOC_PIN, HIGH);
        uint32_t nowUs = (uint32_t)micros();
        g_t_start_us    = (uint64_t)nowUs;
        g_store_fill    = 0;
        g_debug_count   = 0;
        g_debug_last_us = nowUs;
        g_state = SAMPLING;
    } else if (level == LOW && g_state == SAMPLING) {
        digitalWrite(SYNC_TO_PSOC_PIN, LOW);
        g_state = STOPPED;
    } else if (g_state != SAMPLING) {
        digitalWrite(SYNC_TO_PSOC_PIN, LOW);
    }
}

