simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main.cpp
/* ── Forward declarations ────────────────────────────────────────────────── */
static void allocStore(uint16_t n_batches);
static void handleReqBatch(const MsgReqBatch *msg);

/* ── Callbacks ESP-NOW ───────────────────────────────────────────────────── */

static void sendCfgAck(uint8_t sub_cmd, uint8_t ok)
{
    MsgCfgAck ack = { CMD_CFG_ACK, NODE_ID, sub_cmd, ok };
    espnowSend(MASTER_MAC, (const uint8_t *)&ack, sizeof(ack));
}

static bool isGainCode(uint8_t code)
{
    return code <= 8u;
}

static void applyConfirmedConfig(uint8_t sub_cmd, uint8_t value)
{
    switch (sub_cmd) {
        case 0xA6:
            g_pga_code = value;
            break;
        case 0xA9:
            g_pgavdac = value;
            break;
        case 0xAA:
            g_vdac_byte = value;
            break;
        default:
            break;
    }
}

static void waitForPsocConfigAck(uint8_t sub_cmd, uint8_t param)
{
    g_cfg_sub_cmd = sub_cmd;
    g_cfg_param = param;
    g_cfg_start_ms = millis();
    g_cfg_timeout_ms = (sub_cmd == PSOC_CMD_CALIBRATE)
                     ? PSOC_CAL_ACK_TIMEOUT_MS
                     : PSOC_CFG_ACK_TIMEOUT_MS;
    g_cfg_waiting = true;
    if (sub_cmd == PSOC_CMD_CALIBRATE) {
        /* Que el primer "calibrando..." salga ya en el proximo loop(),
         * sin esperar PSOC_CAL_PROGRESS_ACK_PERIOD_MS. */
        g_cal_progress_ack_ms = g_cfg_start_ms - PSOC_CAL_PROGRESS_ACK_PERIOD_MS;
    }
}

static bool ensurePsocReadyForConfig()
{
    psoc.poll();
    if (g_psocConnected && psoc.hasLastByte() &&
        psoc.lastByteAgeMs() <= PSOC_CFG_READY_STALE_MS) {
        return true;
    }

    const bool ready = psoc.probe(250);
    g_psocConnected = ready;
    if (!ready) {
        SLAVE_LOG_PRINTF("[SLAVE] PSoC cfg probe failed age=%lu bytes=%lu\n",
                         (unsigned long)psoc.lastByteAgeMs(),
                         (unsigned long)psoc.bytesRx());
        LOGM("CFG_PSOC_MISS", "age=%lu,bytes=%lu",
             (unsigned long)psoc.lastByteAgeMs(),
             (unsigned long)psoc.bytesRx());
    }
    return ready;
}

static void servicePsocConfigAck()
{
    if (g_state == SAMPLING) {
        return;   /* Nunca emitir ACK/timeout por radio durante la captura. */
    }

    uint8_t ackCmd = 0;
    uint8_t ackVal = 0;
    while (psoc.takeConfigAck(ackCmd, ackVal)) {
        g_psocConnected = true;
        if (g_cfg_waiting && ackCmd == g_cfg_sub_cmd) {
            const uint8_t ok = (ackVal == g_cfg_param) ? 1u : 0u;
            if (ok) {
                applyConfirmedConfig(ackCmd, ackVal);
            }
            sendCfgAck(g_cfg_sub_cmd, ok);
            SLAVE_LOG_PRINTF("[SLAVE] PSoC cfg ack sub=0x%02X val=%u expected=%u ok=%u\n",
                             ackCmd, ackVal, g_cfg_param, ok);
            LOGM("CFG_ACK", "sub=0x%02X,val=%u,expected=%u,ok=%u",
                 ackCmd, ackVal, g_cfg_param, ok);
            g_cfg_waiting = false;
        } else {
            applyConfirmedConfig(ackCmd, ackVal);
            SLAVE_LOG_PRINTF("[SLAVE] PSoC cfg ack unsolicited sub=0x%02X val=%u\n",
                             ackCmd, ackVal);
            LOGM("CFG_ACK_UNSOL", "sub=0x%02X,val=%u", ackCmd, ackVal);
        }
    }

    if (g_cfg_waiting &&
        (uint32_t)(millis() - g_cfg_start_ms) >= g_cfg_timeout_ms) {
        sendCfgAck(g_cfg_sub_cmd, 0);
        SLAVE_LOG_PRINTF("[SLAVE] PSoC cfg ack timeout sub=0x%02X expected=%u elapsed=%lu/%lu\n",
                         g_cfg_sub_cmd, g_cfg_param,
                         (unsigned long)(millis() - g_cfg_start_ms),
                         (unsigned long)g_cfg_timeout_ms);
        LOGM("CFG_TIMEOUT", "sub=0x%02X,expected=%u,elapsed=%lu,timeout=%lu",
             g_cfg_sub_cmd, g_cfg_param,
             (unsigned long)(millis() - g_cfg_start_ms),
             (unsigned long)g_cfg_timeout_ms);
        g_cfg_waiting = false;
    }

    /* "Calibrando..." (ok=2) hacia el maestro: por temporizador propio del
     * ESP, independiente de que el stream de diagnostico del PSoC llegue.
     * Mientras g_cfg_waiting este activo para CALIBRATE (hasta
     * PSOC_CAL_ACK_TIMEOUT_MS=450s o el ack final), repetir cada
     * PSOC_CAL_PROGRESS_ACK_PERIOD_MS para que el panel muestre el estado
     * "Calibrando..." de forma confiable. */
    if (g_cfg_waiting && g_cfg_sub_cmd == PSOC_CMD_CALIBRATE) {
        uint32_t now = millis();
        if ((uint32_t)(now - g_cal_progress_ack_ms) >= PSOC_CAL_PROGRESS_ACK_PERIOD_MS) {
            g_cal_progress_ack_ms = now;
            sendCfgAck(PSOC_CMD_CALIBRATE, 2);
        }
    }
}

static bool captureOrDumpBusy()
{
    return (g_state == SAMPLING || g_state == HOT_WAIT ||
            g_view_remaining != 0 ||
            (g_state == STOPPED && g_rec_n_batches > 0));
}

static bool requestPsocCalibration(const char *source)
{
    if (captureOrDumpBusy()) {
        SLAVE_LOG_PRINTF("[%s] cal ignored: capture/dump busy state=%d\n",
                         source, (int)g_state);
        LOGM("CAL_REQ", "source=%s,ok=0,reason=capture_busy,state=%d",
             source, (int)g_state);
        return false;
    }

    servicePsocConfigAck();
    if (g_cfg_waiting) {
        SLAVE_LOG_PRINTF("[%s] cal ignored: pending sub=0x%02X\n",
                         source, g_cfg_sub_cmd);
        LOGM("CAL_REQ", "source=%s,ok=0,reason=cfg_busy,pending=0x%02X",
             source, g_cfg_sub_cmd);
        return false;
    }

    if (!ensurePsocReadyForConfig()) {
        SLAVE_LOG_PRINTF("[%s] cal failed: PSoC not ready\n", source);
        LOGM("CAL_REQ", "source=%s,ok=0,reason=psoc_not_ready", source);
        return false;
    }

    psoc.calibrate();
    waitForPsocConfigAck(PSOC_CMD_CALIBRATE, 1);
    SLAVE_LOG_PRINTF("[%s] cal -> PSoC CMD 0x%02X\n", source, PSOC_CMD_CALIBRATE);
    LOGM("CAL_REQ", "source=%s,ok=1,sub=0x%02X", source, PSOC_CMD_CALIBRATE);
    return true;
}

#if PSOC_AUTO_CAL_ON_READY
static void scheduleAutoCalibration(uint32_t delayMs)
{
    if (!g_auto_cal_requested) {
        g_auto_cal_due_ms = millis() + delayMs;
        SLAVE_LOG_PRINTF("[AUTO_CAL] scheduled in %lu ms (due=%lu)\n",
                         (unsigned long)delayMs, (unsigned long)g_auto_cal_due_ms);
        LOGM("AUTO_CAL", "ev=scheduled,delay_ms=%lu", (unsigned long)delayMs);
    }
}

static void serviceAutoCalibration()
{
    if (g_auto_cal_requested || g_auto_cal_due_ms == 0u) {
        return;
    }
    if ((int32_t)(millis() - g_auto_cal_due_ms) < 0) {
        return;
    }
    if (!g_psocConnected || captureOrDumpBusy() || g_cfg_waiting) {
        SLAVE_LOG_PRINTF("[AUTO_CAL] deferred (psocConnected=%d busy=%d cfg_waiting=%d) retry in %lu ms\n",
                         (int)g_psocConnected, (int)captureOrDumpBusy(), (int)g_cfg_waiting,
                         (unsigned long)PSOC_AUTO_CAL_RETRY_MS);
        LOGM("AUTO_CAL", "ev=deferred,psoc=%d,busy=%d,cfg_waiting=%d",
             (int)g_psocConnected, (int)captureOrDumpBusy(), (int)g_cfg_waiting);
        g_auto_cal_due_ms = millis() + PSOC_AUTO_CAL_RETRY_MS;
        return;
    }
    SLAVE_LOG_PRINTF("[AUTO_CAL] due -> requesting calibration\n");
    if (requestPsocCalibration("AUTO")) {
        g_auto_cal_requested = true;
        g_auto_cal_due_ms = 0u;
        LOGM("AUTO_CAL", "ev=requested,ok=1");
    } else {
        SLAVE_LOG_PRINTF("[AUTO_CAL] request failed, retry in %lu ms\n",
                         (unsigned long)PSOC_AUTO_CAL_RETRY_MS);
        LOGM("AUTO_CAL", "ev=requested,ok=0");
        g_auto_cal_due_ms = millis() + PSOC_AUTO_CAL_RETRY_MS;
    }
}
#else
static void scheduleAutoCalibration(uint32_t) {}
static void serviceAutoCalibration() {}
#endif

#if SLAVE_USB_CMD_ENABLE
static bool usbCommandEquals(const char *cmd, const char *word)
{
    while (*cmd != '\0' && *word != '\0') {
        char a = *cmd++;
        char b = *word++;
        if (a >= 'A' && a <= 'Z') { a = (char)(a - 'A' + 'a'); }
        if (b >= 'A' && b <= 'Z') { b = (char)(b - 'A' + 'a'); }
        if (a != b) { return false; }
    }
    return *cmd == '\0' && *word == '\0';
}

static void requestCalibrationFromUsb()
{
    const bool sent = requestPsocCalibration("USB");
    if (sent) {
        g_auto_cal_requested = true;
        g_auto_cal_due_ms = 0u;
    }
    LOGM("USB_CMD", "cmd=cal,ok=%u,sub=0x%02X",
         (unsigned)sent, PSOC_CMD_CALIBRATE);
}

